app/views/issues/show.erb

SELECT "answers".* FROM "answers" WHERE "answers"."issue_id" = ?  [["issue_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."issue_id" = ?  [["issue_id", 1]]
---

<% if @issue.answer.size != 0 %>