app/views/home/index.erb

      <td><%= link_to issue.title, "#{issues_path}/#{issue.id}"%>
        <div>Comments: <%= issue.issuecomment.all.count %></div> </td>
      <td>
        <% if issue.answer.size != 0 %>
---
SELECT "issues".* FROM "issues"
SELECT COUNT(*) FROM "issuecomments" WHERE "issuecomments"."issue_id" = ?  [["issue_id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."issue_id" = ?  ORDER BY "answers"."created_at" DESC LIMIT 1  [["issue_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."issue_id" = ? AND "answers"."issue_id" = 2  [[nil, 2]]