app/views/user/accountinfo.html.erb

	<% @keywords.all.each do | keyword | %>
		<input class="keywordRoles" type="checkbox" <%= @userinfo.userkeyword.where('keyword_id = ? and user_id = ?', keyword.id, @userinfo.id).count == 1 ? 'checked' : "" %> onclick="Changekeyword(<%= keyword.id %>)"><%= keyword.word %><br />
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "userkeywords" WHERE "userkeywords"."user_id" = ? AND (keyword_id = 1 and user_id = 1)  [["user_id", 1]]