app/controllers/home_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."issue_id" IN (1)
SELECT "issues".* FROM "issues"  ORDER BY "issues"."views" DESC
---
	def index
		@issues = Issue.all.includes(:answer).order(views: :desc)