app/controllers/issues_controller.rb

	def show
	    @issue = Issue.includes(:answer).find(params[:id])
	    if @issue.views == nil
	    	@issue.views = 1
	    else
	    	@issue.views = @issue.views + 1
	    end
	    @issue.save
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."issue_id" = ?  [["issue_id", 1]]
UPDATE "issues" SET "views" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["views", 1], ["updated_at", "2015-04-22 00:42:43.797626"], ["id", 2]]

	def create
	  @issue = Issue.new(issue_params)
	  @issue.views = 0
	  @issue.user_id = session[:user_id]

	  @issue.save
---
INSERT INTO "issues" ("title", "text", "views", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new issue"], ["text", "testing"], ["views", 0], ["created_at", "2015-04-22 00:42:22.285524"], ["updated_at", "2015-04-22 00:42:22.285524"]]

	def addanswer
		@answer = Answer.new(answer_params)
		@answer.score = 0
		@answer.user_id = session[:user_id]
		@answer.save
---
INSERT INTO "answers" ("username", "answertext", "issue_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "testuser3"], ["answertext", "does this work now?"], ["issue_id", 1], ["score", 0], ["created_at", "2015-04-24 00:46:58.569294"], ["updated_at", "2015-04-24 00:46:58.569294"]]

	def answerlist
		@answer = Answer.all
---
SELECT "answers".* FROM "answers"

	def incrementvote
		@vote = Answer.find(params[:answerid])

		if (session[:user_id] && Scorelog.where('answerid = ? and userid = ?', @vote.id, session[:user_id]).count == 0)
			@vote.score += 1
			@vote.save
			@scoreupdate = Scorelog.new
			@scoreupdate.answerid = @vote.id
			@scoreupdate.userid = session[:user_id]
			@scoreupdate.save
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "scorelogs" WHERE (answerid = #{@vote.id} and userid = #{session[:user_id]})
UPDATE "answers" SET "score" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["score", 1], ["updated_at", "2015-05-02 14:52:07.591716"], ["id", 1]]
INSERT INTO "scorelogs" ("answerid", "userid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["answerid", 1], ["userid", 1], ["created_at", "2015-05-02 14:52:07.819742"], ["updated_at", "2015-05-02 14:52:07.819742"]]

	def decrementvote
		@vote = Answer.find(params[:answerid])

		if (session[:user_id] && Scorelog.where('answerid = ? and userid = ?', @vote.id, session[:user_id]).count == 0)
			@vote.score -= 1
			@vote.save
			@scoreupdate = Scorelog.new
			@scoreupdate.answerid = @vote.id
			@scoreupdate.userid = session[:user_id]
			@scoreupdate.save
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "scorelogs" WHERE (answerid = 2 and userid = 1)
UPDATE "answers" SET "score" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["score", -1], ["updated_at", "2015-05-02 15:04:41.510646"], ["id", 2]]
INSERT INTO "scorelogs" ("answerid", "userid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["answerid", 2], ["userid", 1], ["created_at", "2015-05-02 15:04:41.770215"], ["updated_at", "2015-05-02 15:04:41.770215"]]