app/controllers/user_controller.rb

	def create
	  @user = User.new(user_params)
	  if @user.save
---
INSERT INTO "users" ("email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

	def accountinfo
		@userinfo = User.find(session[:user_id])
		@issues = Issue.all.where("user_id" => session[:user_id])
		@answers = Answer.all.where("user_id" => session[:user_id])
		@keywords = Keyword.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "keywords".* FROM "keywords"

	def updatekeywords
		@roleuser = Userkeyword.all.where('keyword_id = ? and user_id = ?', params[:keywordid], session[:user_id])
		if @roleuser.count == 0
			@role = Userkeyword.new
			@role.user_id = session[:user_id]
			@role.keyword_id = params[:keywordid]
			@role.save
---
SELECT COUNT(*) FROM "userkeywords" WHERE (keyword_id = '3' and user_id = 1)
INSERT INTO "userkeywords" ("user_id", "keyword_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["keyword_id", 3], ["created_at", "2015-05-04 00:10:52.423967"], ["updated_at", "2015-05-04 00:10:52.423967"]]